# GetSlabPreferences

## Description
Gets the Slab Preferences. This can be used with the component calls and the Style selectors.

```pascal
FUNCTION GetSlabPreferences : HANDLE;
```

```python
def vs.GetSlabPreferences():
    return HANDLE
```

## Version
Availability: from Vectorworks 2011

## Category
* Objects - Architectural